[{'movie_name': 'The Shawshank Redemption', 'movie_rating': '9.2', 'release_date': '1994-09-23', 'movie_duration': 'PT2H22M', 'movie_description': 'The Shawshank Redemption is a movie starring Tim Robbins, Morgan Freeman, and Bob Gunton. Two imprisoned men bond over a number of years, finding solace and eventual redemption through acts of common decency.'}, {'movie_name': 'The Godfather', 'movie_rating': '9.1', 'release_date': '1972-03-24', 'movie_duration': 'PT2H55M', 'movie_description': "The Godfather is a movie starring Marlon Brando, Al Pacino, and James Caan. An organized crime dynasty's aging patriarch transfers control of his clandestine empire to his reluctant son."}, {'movie_name': 'The Godfather: Part II', 'movie_rating': '9.0', 'release_date': '1974-12-18', 'movie_duration': 'PT3H22M', 'movie_description': 'The Godfather: Part II is a movie starring Al Pacino, Robert De Niro, and Robert Duvall. The early life and career of Vito Corleone in 1920s New York City is portrayed, while his son, Michael, expands and tightens his grip on the...'}, {'movie_name': 'The Dark Knight', 'movie_rating': '9.0', 'release_date': '2008-07-16', 'movie_duration': 'PT2H32M', 'movie_description': 'The Dark Knight is a movie starring Christian Bale, Heath Ledger, and Aaron Eckhart. When the menace known as the Joker wreaks havoc and chaos on the people of Gotham, Batman must accept one of the greatest psychological and...'}, {'movie_name': '12 Angry Men', 'movie_rating': '8.9', 'release_date': '1957-04-10', 'movie_duration': 'PT1H36M', 'movie_description': '12 Angry Men is a movie starring Henry Fonda, Lee J. Cobb, and Martin Balsam. A jury holdout attempts to prevent a miscarriage of justice by forcing his colleagues to reconsider the evidence.'}, {'movie_name': "Schindler's List", 'movie_rating': '8.9', 'release_date': '1993-12-15', 'movie_duration': 'PT3H15M', 'movie_description': "Schindler's List is a movie starring Liam Neeson, Ralph Fiennes, and Ben Kingsley. In German-occupied Poland during World War II, industrialist Oskar Schindler gradually becomes concerned for his Jewish workforce after witnessing..."}, {'movie_name': 'The Lord of the Rings: The Return of the King', 'movie_rating': '8.9', 'release_date': '2003-12-17', 'movie_duration': 'PT3H21M', 'movie_description': "The Lord of the Rings: The Return of the King is a movie starring Elijah Wood, Viggo Mortensen, and Ian McKellen. Gandalf and Aragorn lead the World of Men against Sauron's army to draw his gaze from Frodo and Sam as they approach..."}, {'movie_name': 'Pulp Fiction', 'movie_rating': '8.8', 'release_date': '1994-09-10', 'movie_duration': 'PT2H34M', 'movie_description': 'Pulp Fiction is a movie starring John Travolta, Uma Thurman, and Samuel L. Jackson. The lives of two mob hitmen, a boxer, a gangster and his wife, and a pair of diner bandits intertwine in four tales of violence and redemption.'}, {'movie_name': 'Il buono, il brutto, il cattivo', 'movie_rating': '8.8', 'release_date': '1966-12-23', 'movie_duration': 'PT2H58M', 'movie_description': 'Il buono, il brutto, il cattivo is a movie starring Clint Eastwood, Eli Wallach, and Lee Van Cleef. A bounty hunting scam joins two men in an uneasy alliance against a third in a race to find a fortune in gold buried in a remote...'}, {'movie_name': 'The Lord of the Rings: The Fellowship of the Ring', 'movie_rating': '8.8', 'release_date': '2001-12-19', 'movie_duration': 'PT2H58M', 'movie_description': 'The Lord of the Rings: The Fellowship of the Ring is a movie starring Elijah Wood, Ian McKellen, and Orlando Bloom. A meek Hobbit from the Shire and eight companions set out on a journey to destroy the powerful One Ring and save...'}, {'movie_name': 'Fight Club', 'movie_rating': '8.8', 'release_date': '1999-10-15', 'movie_duration': 'PT2H19M', 'movie_description': 'Fight Club is a movie starring Brad Pitt, Edward Norton, and Meat Loaf. An insomniac office worker and a devil-may-care soap maker form an underground fight club that evolves into much more.'}, {'movie_name': 'Forrest Gump', 'movie_rating': '8.8', 'release_date': '1994-06-23', 'movie_duration': 'PT2H22M', 'movie_description': 'Forrest Gump is a movie starring Tom Hanks, Robin Wright, and Gary Sinise. The presidencies of Kennedy and Johnson, the Vietnam War, the Watergate scandal and other historical events unfold from the perspective of an Alabama man...'}, {'movie_name': 'Inception', 'movie_rating': '8.7', 'release_date': '2010-07-14', 'movie_duration': 'PT2H28M', 'movie_description': 'Inception is a movie starring Leonardo DiCaprio, Joseph Gordon-Levitt, and Elliot Page. A thief who steals corporate secrets through the use of dream-sharing technology is given the inverse task of planting an idea into the mind of...'}, {'movie_name': 'The Lord of the Rings: The Two Towers', 'movie_rating': '8.7', 'release_date': '2002-12-18', 'movie_duration': 'PT2H59M', 'movie_description': 'The Lord of the Rings: The Two Towers is a movie starring Elijah Wood, Ian McKellen, and Viggo Mortensen. While Frodo and Sam edge closer to Mordor with the help of the shifty Gollum, the divided fellowship makes a stand against...'}, {'movie_name': 'Star Wars: Episode V - The Empire Strikes Back', 'movie_rating': '8.7', 'release_date': '1980-05-21', 'movie_duration': 'PT2H4M', 'movie_description': 'Star Wars: Episode V - The Empire Strikes Back is a movie starring Mark Hamill, Harrison Ford, and Carrie Fisher. After the Rebels are brutally overpowered by the Empire on the ice planet Hoth, Luke Skywalker begins Jedi training...'}, {'movie_name': 'The Matrix', 'movie_rating': '8.6', 'release_date': '1999-03-31', 'movie_duration': 'PT2H16M', 'movie_description': 'The Matrix is a movie starring Keanu Reeves, Laurence Fishburne, and Carrie-Anne Moss. When a beautiful stranger leads computer hacker Neo to a forbidding underworld, he discovers the shocking truth--the life he knows is the...'}, {'movie_name': 'Goodfellas', 'movie_rating': '8.6', 'release_date': '1990-09-12', 'movie_duration': 'PT2H26M', 'movie_description': 'Goodfellas is a movie starring Robert De Niro, Ray Liotta, and Joe Pesci. The story of Henry Hill and his life in the mob, covering his relationship with his wife Karen Hill and his mob partners Jimmy Conway and Tommy DeVito in the...'}, {'movie_name': "One Flew Over the Cuckoo's Nest", 'movie_rating': '8.6', 'release_date': '1975-11-19', 'movie_duration': 'PT2H13M', 'movie_description': "One Flew Over the Cuckoo's Nest is a movie starring Jack Nicholson, Louise Fletcher, and Michael Berryman. A criminal pleads insanity and is admitted to a mental institution, where he rebels against the oppressive nurse and rallies..."}, {'movie_name': 'Shichinin no samurai', 'movie_rating': '8.6', 'release_date': '1954-04-26', 'movie_duration': 'PT3H27M', 'movie_description': 'Shichinin no samurai is a movie starring Toshirô Mifune, Takashi Shimura, and Keiko Tsushima. A poor village under attack by bandits recruits seven unemployed samurai to help them defend themselves.'}, {'movie_name': 'Se7en', 'movie_rating': '8.6', 'release_date': '1995-09-22', 'movie_duration': 'PT2H7M', 'movie_description': 'Se7en is a movie starring Morgan Freeman, Brad Pitt, and Kevin Spacey. Two detectives, a rookie and a veteran, hunt a serial killer who uses the seven deadly sins as his motives.'}, {'movie_name': 'La vita è bella', 'movie_rating': '8.6', 'release_date': '1997-12-20', 'movie_duration': 'PT1H56M', 'movie_description': 'La vita è bella is a movie starring Roberto Benigni, Nicoletta Braschi, and Giorgio Cantarini. When an open-minded Jewish librarian and his son become victims of the Holocaust, he uses a perfect mixture of will, humor, and...'}, {'movie_name': 'Cidade de Deus', 'movie_rating': '8.6', 'release_date': '2002-08-30', 'movie_duration': 'PT2H10M', 'movie_description': "Cidade de Deus is a movie starring Alexandre Rodrigues, Leandro Firmino, and Matheus Nachtergaele. In the slums of Rio, two kids' paths diverge as one struggles to become a photographer and the other a kingpin."}, {'movie_name': 'The Silence of the Lambs', 'movie_rating': '8.6', 'release_date': '1991-02-14', 'movie_duration': 'PT1H58M', 'movie_description': 'The Silence of the Lambs is a movie starring Jodie Foster, Anthony Hopkins, and Lawrence A. Bonney. A young F.B.I. cadet must receive the help of an incarcerated and manipulative cannibal killer to help catch another serial killer,...'}, {'movie_name': "It's a Wonderful Life", 'movie_rating': '8.6', 'release_date': '1947-01-07', 'movie_duration': 'PT2H10M', 'movie_description': "It's a Wonderful Life is a movie starring James Stewart, Donna Reed, and Lionel Barrymore. An angel is sent from Heaven to help a desperately frustrated businessman by showing him what life would have been like if he had never..."}, {'movie_name': 'Saving Private Ryan', 'movie_rating': '8.6', 'release_date': '1998-07-24', 'movie_duration': 'PT2H49M', 'movie_description': 'Saving Private Ryan is a movie starring Tom Hanks, Matt Damon, and Tom Sizemore. Following the Normandy Landings, a group of U.S. soldiers go behind enemy lines to retrieve a paratrooper whose brothers have been killed in action.'}, {'movie_name': 'Star Wars', 'movie_rating': '8.6', 'release_date': '1977-05-25', 'movie_duration': 'PT2H1M', 'movie_description': "Star Wars is a movie starring Mark Hamill, Harrison Ford, and Carrie Fisher. Luke Skywalker joins forces with a Jedi Knight, a cocky pilot, a Wookiee and two droids to save the galaxy from the Empire's world-destroying battle..."}, {'movie_name': 'The Green Mile', 'movie_rating': '8.5', 'release_date': '1999-12-10', 'movie_duration': 'PT3H9M', 'movie_description': 'The Green Mile is a movie starring Tom Hanks, Michael Clarke Duncan, and David Morse. The lives of guards on Death Row are affected by one of their charges: a black man accused of child murder and rape, yet who has a mysterious gift.'}, {'movie_name': 'Sen to Chihiro no kamikakushi', 'movie_rating': '8.5', 'release_date': '2001-07-20', 'movie_duration': 'PT2H5M', 'movie_description': "Sen to Chihiro no kamikakushi is a movie starring Daveigh Chase, Suzanne Pleshette, and Miyu Irino. During her family's move to the suburbs, a sullen 10-year-old girl wanders into a world ruled by gods, witches, and spirits, and..."}, {'movie_name': 'Interstellar', 'movie_rating': '8.5', 'release_date': '2014-11-05', 'movie_duration': 'PT2H49M', 'movie_description': "Interstellar is a movie starring Matthew McConaughey, Anne Hathaway, and Jessica Chastain. A team of explorers travel through a wormhole in space in an attempt to ensure humanity's survival."}, {'movie_name': 'Gisaengchung', 'movie_rating': '8.5', 'release_date': '2019-05-30', 'movie_duration': 'PT2H12M', 'movie_description': 'Gisaengchung is a movie starring Kang-ho Song, Sun-kyun Lee, and Yeo-jeong Cho. Greed and class discrimination threaten the newly formed symbiotic relationship between the wealthy Park family and the destitute Kim clan.'}, {'movie_name': 'Léon', 'movie_rating': '8.5', 'release_date': '1994-09-14', 'movie_duration': 'PT1H50M', 'movie_description': 'Léon is a movie starring Jean Reno, Gary Oldman, and Natalie Portman. Mathilda, a 12-year-old girl, is reluctantly taken in by Léon, a professional assassin, after her family is murdered. An unusual relationship forms as she becomes...'}, {'movie_name': 'Seppuku', 'movie_rating': '8.5', 'release_date': '1962-09-16', 'movie_duration': 'PT2H13M', 'movie_description': "Seppuku is a movie starring Tatsuya Nakadai, Akira Ishihama, and Shima Iwashita. When a ronin requesting seppuku at a feudal lord's palace is told of the brutal suicide of another ronin who previously visited, he reveals how their..."}, {'movie_name': 'The Lion King', 'movie_rating': '8.5', 'release_date': '1994-06-23', 'movie_duration': 'PT1H28M', 'movie_description': 'The Lion King is a movie starring Matthew Broderick, Jeremy Irons, and James Earl Jones. Lion prince Simba and his father are targeted by his bitter uncle, who wants to ascend the throne himself.'}, {'movie_name': 'The Usual Suspects', 'movie_rating': '8.5', 'release_date': '1995-07-19', 'movie_duration': 'PT1H46M', 'movie_description': 'The Usual Suspects is a movie starring Kevin Spacey, Gabriel Byrne, and Chazz Palminteri. A sole survivor tells of the twisty events leading up to a horrific gun battle on a boat, which began when five criminals met at a seemingly...'}, {'movie_name': 'The Pianist', 'movie_rating': '8.5', 'release_date': '2002-09-25', 'movie_duration': 'PT2H30M', 'movie_description': 'The Pianist is a movie starring Adrien Brody, Thomas Kretschmann, and Frank Finlay. A Polish Jewish musician struggles to survive the destruction of the Warsaw ghetto of World War II.'}, {'movie_name': 'Terminator 2: Judgment Day', 'movie_rating': '8.5', 'release_date': '1991-07-03', 'movie_duration': 'PT2H17M', 'movie_description': 'Terminator 2: Judgment Day is a movie starring Arnold Schwarzenegger, Linda Hamilton, and Edward Furlong. A cyborg, identical to the one who failed to kill Sarah Connor, must now protect her ten year old son, John Connor, from a...'}, {'movie_name': 'Back to the Future', 'movie_rating': '8.5', 'release_date': '1985-07-03', 'movie_duration': 'PT1H56M', 'movie_description': 'Back to the Future is a movie starring Michael J. Fox, Christopher Lloyd, and Lea Thompson. Marty McFly, a 17-year-old high school student, is accidentally sent thirty years into the past in a time-traveling DeLorean invented by his...'}, {'movie_name': 'American History X', 'movie_rating': '8.5', 'release_date': '1998-07-01', 'movie_duration': 'PT1H59M', 'movie_description': "American History X is a movie starring Edward Norton, Edward Furlong, and Beverly D'Angelo. A former neo-nazi skinhead tries to prevent his younger brother from going down the same wrong path that he did."}, {'movie_name': 'Modern Times', 'movie_rating': '8.5', 'release_date': '1936-02-11', 'movie_duration': 'PT1H27M', 'movie_description': 'Modern Times is a movie starring Charles Chaplin, Paulette Goddard, and Henry Bergman. The Tramp struggles to live in modern industrial society with the help of a young homeless woman.'}, {'movie_name': 'Gladiator', 'movie_rating': '8.5', 'release_date': '2000-05-04', 'movie_duration': 'PT2H35M', 'movie_description': 'Gladiator is a movie starring Russell Crowe, Joaquin Phoenix, and Connie Nielsen. A former Roman General sets out to exact vengeance against the corrupt emperor who murdered his family and sent him into slavery.'}, {'movie_name': 'Psycho', 'movie_rating': '8.5', 'release_date': '1960-08-17', 'movie_duration': 'PT1H49M', 'movie_description': "Psycho is a movie starring Anthony Perkins, Janet Leigh, and Vera Miles. A Phoenix secretary embezzles $40,000 from her employer's client, goes on the run, and checks into a remote motel run by a young man under the domination of..."}, {'movie_name': 'The Departed', 'movie_rating': '8.5', 'release_date': '2006-10-04', 'movie_duration': 'PT2H31M', 'movie_description': 'The Departed is a movie starring Leonardo DiCaprio, Matt Damon, and Jack Nicholson. An undercover cop and a mole in the police attempt to identify each other while infiltrating an Irish gang in South Boston.'}, {'movie_name': 'City Lights', 'movie_rating': '8.5', 'release_date': '1931-03-07', 'movie_duration': 'PT1H27M', 'movie_description': 'City Lights is a movie starring Charles Chaplin, Virginia Cherrill, and Florence Lee. With the aid of a wealthy erratic tippler, a dewy-eyed tramp who has fallen in love with a sightless flower girl accumulates money to be able to...'}, {'movie_name': 'Whiplash', 'movie_rating': '8.5', 'release_date': '2014-10-15', 'movie_duration': 'PT1H46M', 'movie_description': 'Whiplash is a movie starring Miles Teller, J.K. Simmons, and Melissa Benoist. A promising young drummer enrolls at a cut-throat music conservatory where his dreams of greatness are mentored by an instructor who will stop at nothing...'}, {'movie_name': 'The Intouchables', 'movie_rating': '8.5', 'release_date': '2011-11-02', 'movie_duration': 'PT1H52M', 'movie_description': 'Intouchables is a movie starring François Cluzet, Omar Sy, and Anne Le Ny. After he becomes a quadriplegic from a paragliding accident, an aristocrat hires a young man from the projects to be his caregiver.'}, {'movie_name': 'Hotaru no haka', 'movie_rating': '8.5', 'release_date': '1988-04-16', 'movie_duration': 'PT1H29M', 'movie_description': 'Hotaru no haka is a movie starring Tsutomu Tatsumi, Ayano Shiraishi, and Akemi Yamaguchi. A young boy and his little sister struggle to survive in Japan during World War II.'}, {'movie_name': 'The Prestige', 'movie_rating': '8.5', 'release_date': '2006-10-19', 'movie_duration': 'PT2H10M', 'movie_description': 'The Prestige is a movie starring Christian Bale, Hugh Jackman, and Scarlett Johansson. After a tragic accident, two stage magicians engage in a battle to create the ultimate illusion while sacrificing everything they have to outwit...'}, {'movie_name': 'Once Upon a Time in the West', 'movie_rating': '8.4', 'release_date': '1968-12-21', 'movie_duration': 'PT2H45M', 'movie_description': "C'era una volta il West is a movie starring Henry Fonda, Charles Bronson, and Claudia Cardinale. A mysterious stranger with a harmonica joins forces with a notorious desperado to protect a beautiful widow from a ruthless assassin..."}, {'movie_name': 'Casablanca', 'movie_rating': '8.4', 'release_date': '1943-01-23', 'movie_duration': 'PT1H42M', 'movie_description': 'Casablanca is a movie starring Humphrey Bogart, Ingrid Bergman, and Paul Henreid. A cynical expatriate American cafe owner struggles to decide whether or not to help his former lover and her fugitive husband escape the Nazis in...'}, {'movie_name': 'Nuovo Cinema Paradiso', 'movie_rating': '8.4', 'release_date': '1988-11-17', 'movie_duration': 'PT2H35M', 'movie_description': 'Nuovo Cinema Paradiso is a movie starring Philippe Noiret, Enzo Cannavale, and Antonella Attili. A filmmaker recalls his childhood when falling in love with the pictures at the cinema of his home village and forms a deep friendship...'}, {'movie_name': 'Rear Window', 'movie_rating': '8.4', 'release_date': '1954-09-01', 'movie_duration': 'PT1H52M', 'movie_description': 'Rear Window is a movie starring James Stewart, Grace Kelly, and Wendell Corey. A wheelchair-bound photographer spies on his neighbors from his apartment window and becomes convinced one of them has committed murder.'}, {'movie_name': 'Alien', 'movie_rating': '8.4', 'release_date': '1979-05-28', 'movie_duration': 'PT1H57M', 'movie_description': 'Alien is a movie starring Sigourney Weaver, Tom Skerritt, and John Hurt. After a space merchant vessel receives an unknown transmission as a distress call, one of the crew is attacked by a mysterious life form and they soon realize...'}, {'movie_name': 'Apocalypse Now', 'movie_rating': '8.4', 'release_date': '1979-08-15', 'movie_duration': 'PT2H27M', 'movie_description': 'Apocalypse Now is a movie starring Martin Sheen, Marlon Brando, and Robert Duvall. A U.S. Army officer serving in Vietnam is tasked with assassinating a renegade Special Forces Colonel who sees himself as a god.'}, {'movie_name': 'Memento', 'movie_rating': '8.4', 'release_date': '2000-10-11', 'movie_duration': 'PT1H53M', 'movie_description': "Memento is a movie starring Guy Pearce, Carrie-Anne Moss, and Joe Pantoliano. A man with short-term memory loss attempts to track down his wife's murderer."}, {'movie_name': 'The Great Dictator', 'movie_rating': '8.4', 'release_date': '1941-01-01', 'movie_duration': 'PT2H5M', 'movie_description': "The Great Dictator is a movie starring Charles Chaplin, Paulette Goddard, and Jack Oakie. Dictator Adenoid Hynkel tries to expand his empire while a poor Jewish barber tries to avoid persecution from Hynkel's regime."}, {'movie_name': 'Raiders of the Lost Ark', 'movie_rating': '8.4', 'release_date': '1981-06-12', 'movie_duration': 'PT1H55M', 'movie_description': "Raiders of the Lost Ark is a movie starring Harrison Ford, Karen Allen, and Paul Freeman. In 1936, archaeologist and adventurer Indiana Jones is hired by the U.S. government to find the Ark of the Covenant before Adolf Hitler's..."}, {'movie_name': 'Django Unchained', 'movie_rating': '8.4', 'release_date': '2012-12-25', 'movie_duration': 'PT2H45M', 'movie_description': 'Django Unchained is a movie starring Jamie Foxx, Christoph Waltz, and Leonardo DiCaprio. With the help of a German bounty-hunter, a freed slave sets out to rescue his wife from a brutal plantation-owner in Mississippi.'}, {'movie_name': 'The Lives of Others', 'movie_rating': '8.4', 'release_date': '2006-03-23', 'movie_duration': 'PT2H17M', 'movie_description': 'Das Leben der Anderen is a movie starring Ulrich Mühe, Martina Gedeck, and Sebastian Koch. In 1984 East Berlin, an agent of the secret police, conducting surveillance on a writer and his lover, finds himself becoming increasingly...'}, {'movie_name': 'Paths of Glory', 'movie_rating': '8.4', 'release_date': '1957-10-25', 'movie_duration': 'PT1H28M', 'movie_description': 'Paths of Glory is a movie starring Kirk Douglas, Ralph Meeker, and Adolphe Menjou. After refusing to attack an enemy position, a general accuses the soldiers of cowardice and their commanding officer must defend them.'}, {'movie_name': 'WALL·E', 'movie_rating': '8.4', 'release_date': '2008-06-26', 'movie_duration': 'PT1H38M', 'movie_description': 'WALL·E is a movie starring Ben Burtt, Elissa Knight, and Jeff Garlin. In the distant future, a small waste-collecting robot inadvertently embarks on a space journey that will ultimately decide the fate of mankind.'}, {'movie_name': 'Hamilton', 'movie_rating': '8.4', 'release_date': '2020-07-03', 'movie_duration': 'PT2H40M', 'movie_description': "Hamilton is a movie starring Lin-Manuel Miranda, Phillipa Soo, and Leslie Odom Jr.. The real life of one of America's foremost founding fathers and first Secretary of the Treasury, Alexander Hamilton. Captured live on Broadway from..."}, {'movie_name': 'Joker', 'movie_rating': '8.4', 'release_date': '2019-10-01', 'movie_duration': 'PT2H2M', 'movie_description': 'Joker is a movie starring Joaquin Phoenix, Robert De Niro, and Zazie Beetz. In Gotham City, mentally troubled comedian Arthur Fleck is disregarded and mistreated by society. He then embarks on a downward spiral of revolution and...'}, {'movie_name': 'The Shining', 'movie_rating': '8.4', 'release_date': '1980-06-13', 'movie_duration': 'PT2H26M', 'movie_description': 'The Shining is a movie starring Jack Nicholson, Shelley Duvall, and Danny Lloyd. A family heads to an isolated hotel for the winter where a sinister presence influences the father into violence, while his psychic son sees horrific...'}, {'movie_name': 'Avengers: Infinity War', 'movie_rating': '8.4', 'release_date': '2018-04-25', 'movie_duration': 'PT2H29M', 'movie_description': 'Avengers: Infinity War is a movie starring Robert Downey Jr., Chris Hemsworth, and Mark Ruffalo. The Avengers and their allies must be willing to sacrifice all in an attempt to defeat the powerful Thanos before his blitz of...'}, {'movie_name': 'Sunset Blvd.', 'movie_rating': '8.4', 'release_date': '1950-09-29', 'movie_duration': 'PT1H50M', 'movie_description': 'Sunset Blvd. is a movie starring William Holden, Gloria Swanson, and Erich von Stroheim. A screenwriter develops a dangerous relationship with a faded film star determined to make a triumphant return.'}, {'movie_name': 'Witness for the Prosecution', 'movie_rating': '8.4', 'release_date': '1958-02-06', 'movie_duration': 'PT1H56M', 'movie_description': 'Witness for the Prosecution is a movie starring Tyrone Power, Marlene Dietrich, and Charles Laughton. A veteran British barrister must defend his client in a murder trial that has surprise after surprise.'}, {'movie_name': 'Spider-Man: Into the Spider-Verse', 'movie_rating': '8.3', 'release_date': '2018-12-12', 'movie_duration': 'PT1H57M', 'movie_description': 'Spider-Man: Into the Spider-Verse is a movie starring Shameik Moore, Jake Johnson, and Hailee Steinfeld. Teen Miles Morales becomes the Spider-Man of his universe, and must join with five spider-powered individuals from other...'}, {'movie_name': 'Oldeuboi', 'movie_rating': '8.3', 'release_date': '2003-11-21', 'movie_duration': 'PT2H', 'movie_description': 'Oldeuboi is a movie starring Choi Min-sik, Yoo Ji-Tae, and Kang Hye-jeong. After being kidnapped and imprisoned for fifteen years, Oh Dae-Su is released, only to find that he must find his captor in five days.'}, {'movie_name': 'Mononoke-hime', 'movie_rating': '8.3', 'release_date': '1997-07-12', 'movie_duration': 'PT2H14M', 'movie_description': "Mononoke-hime is a movie starring Yôji Matsuda, Yuriko Ishida, and Yûko Tanaka. On a journey to find the cure for a Tatarigami's curse, Ashitaka finds himself in the middle of a war between the forest gods and Tatara, a mining..."}, {'movie_name': 'Dr. Strangelove or: How I Learned to Stop Worrying and Love the Bomb', 'movie_rating': '8.3', 'release_date': '1964-01-29', 'movie_duration': 'PT1H35M', 'movie_description': 'Dr. Strangelove or: How I Learned to Stop Worrying and Love the Bomb is a movie starring Peter Sellers, George C. Scott, and Sterling Hayden. An insane general triggers a path to nuclear holocaust that a War Room full of politicians...'}, {'movie_name': 'The Dark Knight Rises', 'movie_rating': '8.3', 'release_date': '2012-07-19', 'movie_duration': 'PT2H44M', 'movie_description': "The Dark Knight Rises is a movie starring Christian Bale, Tom Hardy, and Anne Hathaway. Eight years after the Joker's reign of anarchy, Batman, with the help of the enigmatic Catwoman, is forced from his exile to save Gotham City..."}, {'movie_name': 'Once Upon a Time in America', 'movie_rating': '8.3', 'release_date': '1984-05-23', 'movie_duration': 'PT3H49M', 'movie_description': 'Once Upon a Time in America is a movie starring Robert De Niro, James Woods, and Elizabeth McGovern. A former Prohibition-era Jewish gangster returns to the Lower East Side of Manhattan over thirty years later, where he once again...'}, {'movie_name': 'Kimi no na wa.', 'movie_rating': '8.3', 'release_date': '2016-08-26', 'movie_duration': 'PT1H46M', 'movie_description': 'Kimi no na wa. is a movie starring Ryûnosuke Kamiki, Mone Kamishiraishi, and Ryô Narita. Two strangers find themselves linked in a bizarre way. When a connection forms, will distance be the only thing to keep them apart?'}, {'movie_name': 'Aliens', 'movie_rating': '8.3', 'release_date': '1986-07-18', 'movie_duration': 'PT2H17M', 'movie_description': 'Aliens is a movie starring Sigourney Weaver, Michael Biehn, and Carrie Henn. Fifty-seven years after surviving an apocalyptic attack aboard her space vessel by merciless space creatures, Officer Ripley awakens from hyper-sleep and...'}, {'movie_name': 'Coco', 'movie_rating': '8.3', 'release_date': '2017-10-27', 'movie_duration': 'PT1H45M', 'movie_description': "Coco is a movie starring Anthony Gonzalez, Gael García Bernal, and Benjamin Bratt. Aspiring musician Miguel, confronted with his family's ancestral ban on music, enters the Land of the Dead to find his great-great-grandfather, a..."}, {'movie_name': 'Avengers: Endgame', 'movie_rating': '8.3', 'release_date': '2019-04-24', 'movie_duration': 'PT3H1M', 'movie_description': 'Avengers: Endgame is a movie starring Robert Downey Jr., Chris Evans, and Mark Ruffalo. After the devastating events of Avengers: Infinity War (2018), the universe is in ruins. With the help of remaining allies, the Avengers...'}, {'movie_name': 'Capharnaüm', 'movie_rating': '8.3', 'release_date': '2018-09-20', 'movie_duration': 'PT2H6M', 'movie_description': 'Capharnaüm is a movie starring Zain Al Rafeea, Yordanos Shiferaw, and Boluwatife Treasure Bankole. While serving a five-year sentence for a violent crime, a 12-year-old boy sues his parents for neglect.'}, {'movie_name': 'American Beauty', 'movie_rating': '8.3', 'release_date': '1999-10-01', 'movie_duration': 'PT2H2M', 'movie_description': "American Beauty is a movie starring Kevin Spacey, Annette Bening, and Thora Birch. A sexually frustrated suburban father has a mid-life crisis after becoming infatuated with his daughter's best friend."}, {'movie_name': 'Braveheart', 'movie_rating': '8.3', 'release_date': '1995-05-24', 'movie_duration': 'PT2H58M', 'movie_description': 'Braveheart is a movie starring Mel Gibson, Sophie Marceau, and Patrick McGoohan. Scottish warrior William Wallace leads his countrymen in a rebellion to free his homeland from the tyranny of King Edward I of England.'}, {'movie_name': 'Tengoku to jigoku', 'movie_rating': '8.3', 'release_date': '1963-03-01', 'movie_duration': 'PT2H23M', 'movie_description': "Tengoku to jigoku is a movie starring Toshirô Mifune, Yutaka Sada, and Tatsuya Nakadai. An executive of a shoe company becomes a victim of extortion when his chauffeur's son is kidnapped and held for ransom."}, {'movie_name': 'Toy Story', 'movie_rating': '8.3', 'release_date': '1995-11-22', 'movie_duration': 'PT1H21M', 'movie_description': "Toy Story is a movie starring Tom Hanks, Tim Allen, and Don Rickles. A cowboy doll is profoundly threatened and jealous when a new spaceman figure supplants him as top toy in a boy's room."}, {'movie_name': 'Das Boot', 'movie_rating': '8.3', 'release_date': '1981-09-17', 'movie_duration': 'PT2H29M', 'movie_description': 'Das Boot is a movie starring Jürgen Prochnow, Herbert Grönemeyer, and Klaus Wennemann. The claustrophobic world of a WWII German U-boat; boredom, filth and sheer terror.'}, {'movie_name': '3 Idiots', 'movie_rating': '8.3', 'release_date': '2009-12-24', 'movie_duration': 'PT2H50M', 'movie_description': '3 Idiots is a movie starring Aamir Khan, Madhavan, and Mona Singh. Two friends are searching for their long lost companion. They revisit their college days and recall the memories of their friend who inspired them to think...'}, {'movie_name': 'Amadeus', 'movie_rating': '8.3', 'release_date': '1984-09-19', 'movie_duration': 'PT2H40M', 'movie_description': 'Amadeus is a movie starring F. Murray Abraham, Tom Hulce, and Elizabeth Berridge. The life, success and troubles of Wolfgang Amadeus Mozart, as told by Antonio Salieri, the contemporaneous composer who was insanely jealous of...'}, {'movie_name': 'Inglourious Basterds', 'movie_rating': '8.3', 'release_date': '2009-08-19', 'movie_duration': 'PT2H33M', 'movie_description': "Inglourious Basterds is a movie starring Brad Pitt, Diane Kruger, and Eli Roth. In Nazi-occupied France during World War II, a plan to assassinate Nazi leaders by a group of Jewish U.S. soldiers coincides with a theatre owner's..."}, {'movie_name': 'Good Will Hunting', 'movie_rating': '8.3', 'release_date': '1998-01-09', 'movie_duration': 'PT2H6M', 'movie_description': 'Good Will Hunting is a movie starring Robin Williams, Matt Damon, and Ben Affleck. Will Hunting, a janitor at M.I.T., has a gift for mathematics, but needs help from a psychologist to find direction in his life.'}, {'movie_name': 'Star Wars: Episode VI - Return of the Jedi', 'movie_rating': '8.3', 'release_date': '1983-05-25', 'movie_duration': 'PT2H11M', 'movie_description': 'Star Wars: Episode VI - Return of the Jedi is a movie starring Mark Hamill, Harrison Ford, and Carrie Fisher. After a daring mission to rescue Han Solo from Jabba the Hutt, the Rebels dispatch to Endor to destroy the second Death...'}, {'movie_name': 'Taare Zameen Par', 'movie_rating': '8.3', 'release_date': '2007-12-21', 'movie_duration': 'PT2H45M', 'movie_description': 'Taare Zameen Par is a movie starring Darsheel Safary, Aamir Khan, and Tisca Chopra. An eight-year-old boy is thought to be a lazy trouble-maker, until the new art teacher has the patience and compassion to discover the real problem...'}, {'movie_name': 'Reservoir Dogs', 'movie_rating': '8.3', 'release_date': '1992-09-02', 'movie_duration': 'PT1H39M', 'movie_description': 'Reservoir Dogs is a movie starring Harvey Keitel, Tim Roth, and Michael Madsen. When a simple jewelry heist goes horribly wrong, the surviving criminals begin to suspect that one of them is a police informant.'}, {'movie_name': '2001: A Space Odyssey', 'movie_rating': '8.3', 'release_date': '1968-04-11', 'movie_duration': 'PT2H29M', 'movie_description': '2001: A Space Odyssey is a movie starring Keir Dullea, Gary Lockwood, and William Sylvester. After discovering a mysterious artifact buried beneath the Lunar surface, mankind sets off on a quest to find its origins with help from...'}, {'movie_name': 'Requiem for a Dream', 'movie_rating': '8.3', 'release_date': '2000-11-03', 'movie_duration': 'PT1H42M', 'movie_description': 'Requiem for a Dream is a movie starring Ellen Burstyn, Jared Leto, and Jennifer Connelly. The drug-induced utopias of four Coney Island people are shattered when their addictions run deep.'}, {'movie_name': 'Jagten', 'movie_rating': '8.3', 'release_date': '2012-10-25', 'movie_duration': 'PT1H55M', 'movie_description': "Jagten is a movie starring Mads Mikkelsen, Thomas Bo Larsen, and Annika Wedderkopp. A teacher lives a lonely life, all the while struggling over his son's custody. His life slowly gets better as he finds love and receives good news..."}, {'movie_name': 'Vertigo', 'movie_rating': '8.3', 'release_date': '1958-05-22', 'movie_duration': 'PT2H8M', 'movie_description': 'Vertigo is a movie starring James Stewart, Kim Novak, and Barbara Bel Geddes. A former police detective juggles wrestling with his personal demons and becoming obsessed with a hauntingly beautiful woman.'}, {'movie_name': 'M - Eine Stadt sucht einen Mörder', 'movie_rating': '8.3', 'release_date': '1931-08-31', 'movie_duration': 'PT1H39M', 'movie_description': 'M - Eine Stadt sucht einen Mörder is a movie starring Peter Lorre, Ellen Widmann, and Inge Landgut. When the police in a German city are unable to catch a child-murderer, other criminals join in the manhunt.'}, {'movie_name': 'Eternal Sunshine of the Spotless Mind', 'movie_rating': '8.3', 'release_date': '2004-03-19', 'movie_duration': 'PT1H48M', 'movie_description': 'Eternal Sunshine of the Spotless Mind is a movie starring Jim Carrey, Kate Winslet, and Tom Wilkinson. When their relationship turns sour, a couple undergoes a medical procedure to have each other erased from their memories.'}, {'movie_name': 'Citizen Kane', 'movie_rating': '8.3', 'release_date': '1941-06-06', 'movie_duration': 'PT1H59M', 'movie_description': "Citizen Kane is a movie starring Orson Welles, Joseph Cotten, and Dorothy Comingore. Following the death of publishing tycoon Charles Foster Kane, reporters scramble to uncover the meaning of his final utterance; 'Rosebud'."}, {'movie_name': 'Dangal', 'movie_rating': '8.3', 'release_date': '2016-12-21', 'movie_duration': 'PT2H41M', 'movie_description': 'Dangal is a movie starring Aamir Khan, Sakshi Tanwar, and Fatima Sana Shaikh. Former wrestler Mahavir Singh Phogat and his two wrestler daughters struggle towards glory at the Commonwealth Games in the face of societal oppression.'}, {'movie_name': 'Idi i smotri', 'movie_rating': '8.2', 'release_date': '1985-10-17', 'movie_duration': 'PT2H22M', 'movie_description': 'Idi i smotri is a movie starring Aleksey Kravchenko, Olga Mironova, and Liubomiras Laucevicius. After finding an old rifle, a young boy joins the Soviet resistance movement against ruthless German forces and experiences the horrors...'}, {'movie_name': "Singin' in the Rain", 'movie_rating': '8.2', 'release_date': '1952-04-11', 'movie_duration': 'PT1H43M', 'movie_description': "Singin' in the Rain is a movie starring Gene Kelly, Donald O'Connor, and Debbie Reynolds. A silent film production company and cast make a difficult transition to sound."}, {'movie_name': 'The Kid', 'movie_rating': '8.2', 'release_date': '1921-02-06', 'movie_duration': 'PT1H8M', 'movie_description': 'The Kid is a movie starring Charles Chaplin, Edna Purviance, and Jackie Coogan. The Tramp cares for an abandoned child, but events put that relationship in jeopardy.'}, {'movie_name': 'Ladri di biciclette', 'movie_rating': '8.2', 'release_date': '1948-11-24', 'movie_duration': 'PT1H29M', 'movie_description': "Ladri di biciclette is a movie starring Lamberto Maggiorani, Enzo Staiola, and Lianella Carell. In post-war Italy, a working-class man's bicycle is stolen. He and his son set out to find it."}, {'movie_name': 'Full Metal Jacket', 'movie_rating': '8.2', 'release_date': '1987-06-26', 'movie_duration': 'PT1H56M', 'movie_description': "Full Metal Jacket is a movie starring Matthew Modine, R. Lee Ermey, and Vincent D'Onofrio. A pragmatic U.S. Marine observes the dehumanizing effects the Vietnam War has on his fellow recruits from their brutal boot camp training to..."}, {'movie_name': 'Ikiru', 'movie_rating': '8.2', 'release_date': '1952-10-09', 'movie_duration': 'PT2H23M', 'movie_description': "Ikiru is a movie starring Takashi Shimura, Nobuo Kaneko, and Shin'ichi Himori. A bureaucrat tries to find a meaning in his life after he discovers he has terminal cancer."}, {'movie_name': 'Snatch', 'movie_rating': '8.2', 'release_date': '2000-09-01', 'movie_duration': 'PT1H42M', 'movie_description': 'Snatch is a movie starring Jason Statham, Brad Pitt, and Benicio Del Toro. Unscrupulous boxing promoters, violent bookmakers, a Russian gangster, incompetent amateur robbers and supposedly Jewish jewelers fight to track down a...'}, {'movie_name': 'North by Northwest', 'movie_rating': '8.2', 'release_date': '1959-09-08', 'movie_duration': 'PT2H16M', 'movie_description': 'North by Northwest is a movie starring Cary Grant, Eva Marie Saint, and James Mason. A New York City advertising executive goes on the run after being mistaken for a government agent by a group of foreign spies.'}, {'movie_name': 'Scarface', 'movie_rating': '8.2', 'release_date': '1983-12-09', 'movie_duration': 'PT2H50M', 'movie_description': 'Scarface is a movie starring Al Pacino, Michelle Pfeiffer, and Steven Bauer. In 1980 Miami, a determined Cuban immigrant takes over a drug cartel and succumbs to greed.'}, {'movie_name': 'A Clockwork Orange', 'movie_rating': '8.2', 'release_date': '1972-01-13', 'movie_duration': 'PT2H16M', 'movie_description': "A Clockwork Orange is a movie starring Malcolm McDowell, Patrick Magee, and Michael Bates. In the future, a sadistic gang leader is imprisoned and volunteers for a conduct-aversion experiment, but it doesn't go as planned."}, {'movie_name': '1917', 'movie_rating': '8.2', 'release_date': '2020-01-02', 'movie_duration': 'PT1H59M', 'movie_description': '1917 is a movie starring Dean-Charles Chapman, George MacKay, and Daniel Mays. April 6th, 1917. As a regiment assembles to wage war deep in enemy territory, two soldiers are assigned to race against time and deliver a message that...'}, {'movie_name': 'Incendies', 'movie_rating': '8.2', 'release_date': '2011-01-12', 'movie_duration': 'PT2H11M', 'movie_description': "Incendies is a movie starring Lubna Azabal, Mélissa Désormeaux-Poulin, and Maxim Gaudette. Twins journey to the Middle East to discover their family history and fulfill their mother's last wishes."}, {'movie_name': 'Taxi Driver', 'movie_rating': '8.2', 'release_date': '1976-02-08', 'movie_duration': 'PT1H54M', 'movie_description': 'Taxi Driver is a movie starring Robert De Niro, Jodie Foster, and Cybill Shepherd. A mentally unstable veteran works as a nighttime taxi driver in New York City, where the perceived decadence and sleaze fuels his urge for violent...'}, {'movie_name': 'Jodaeiye Nader az Simin', 'movie_rating': '8.2', 'release_date': '2011-03-16', 'movie_duration': 'PT2H3M', 'movie_description': 'Jodaeiye Nader az Simin is a movie starring Payman Maadi, Leila Hatami, and Sareh Bayat. A married couple are faced with a difficult decision - to improve the life of their child by moving to another country or to stay in Iran and...'}, {'movie_name': 'The Sting', 'movie_rating': '8.2', 'release_date': '1973-12-25', 'movie_duration': 'PT2H9M', 'movie_description': 'The Sting is a movie starring Paul Newman, Robert Redford, and Robert Shaw. Two grifters team up to pull off the ultimate con.'}, {'movie_name': 'Toy Story 3', 'movie_rating': '8.2', 'release_date': '2010-06-16', 'movie_duration': 'PT1H43M', 'movie_description': "Toy Story 3 is a movie starring Tom Hanks, Tim Allen, and Joan Cusack. The toys are mistakenly delivered to a day-care center instead of the attic right before Andy leaves for college, and it's up to Woody to convince the other toys..."}, {'movie_name': 'Lawrence of Arabia', 'movie_rating': '8.2', 'release_date': '1962-12-11', 'movie_duration': 'PT3H48M', 'movie_description': "Lawrence of Arabia is a movie starring Peter O'Toole, Alec Guinness, and Anthony Quinn. The story of T.E. Lawrence, the English officer who successfully united and led the diverse, often warring, Arab tribes during World War I in..."}, {'movie_name': 'Amélie', 'movie_rating': '8.2', 'release_date': '2001-04-25', 'movie_duration': 'PT2H2M', 'movie_description': "Le fabuleux destin d'Amélie Poulain is a movie starring Audrey Tautou, Mathieu Kassovitz, and Rufus. Amélie is an innocent and naive girl in Paris with her own sense of justice. She decides to help those around her and, along the..."}, {'movie_name': 'Metropolis', 'movie_rating': '8.2', 'release_date': '1927-02-06', 'movie_duration': 'PT2H33M', 'movie_description': "Metropolis is a movie starring Brigitte Helm, Alfred Abel, and Gustav Fröhlich. In a futuristic city sharply divided between the working class and the city planners, the son of the city's mastermind falls in love with a..."}, {'movie_name': 'The Father', 'movie_rating': '8.2', 'release_date': '2020-12-23', 'movie_duration': 'PT1H37M', 'movie_description': 'The Father is a movie starring Anthony Hopkins, Olivia Colman, and Mark Gatiss. A man refuses all assistance from his daughter as he ages. As he tries to make sense of his changing circumstances, he begins to doubt his loved ones,...'}, {'movie_name': 'The Apartment', 'movie_rating': '8.2', 'release_date': '1960-06-29', 'movie_duration': 'PT2H5M', 'movie_description': 'The Apartment is a movie starring Jack Lemmon, Shirley MacLaine, and Fred MacMurray. A man tries to rise in his company by letting its executives use his apartment for trysts, but complications and a romance of his own ensue.'}, {'movie_name': 'Per qualche dollaro in più', 'movie_rating': '8.2', 'release_date': '1965-12-20', 'movie_duration': 'PT2H12M', 'movie_description': 'Per qualche dollaro in più is a movie starring Clint Eastwood, Lee Van Cleef, and Gian Maria Volontè. Two bounty hunters with the same intentions team up to track down a Western outlaw.'}, {'movie_name': 'Double Indemnity', 'movie_rating': '8.2', 'release_date': '1944-04-24', 'movie_duration': 'PT1H47M', 'movie_description': 'Double Indemnity is a movie starring Fred MacMurray, Barbara Stanwyck, and Edward G. Robinson. An insurance representative lets himself be talked by a seductive housewife into a murder/insurance fraud scheme that arouses the...'}, {'movie_name': 'To Kill a Mockingbird', 'movie_rating': '8.2', 'release_date': '1962-12-20', 'movie_duration': 'PT2H9M', 'movie_description': 'To Kill a Mockingbird is a movie starring Gregory Peck, John Megna, and Frank Overton. Atticus Finch, a lawyer in the Depression-era South, defends a black man against an undeserved rape charge, and his children against prejudice.'}, {'movie_name': 'Up', 'movie_rating': '8.2', 'release_date': '2009-05-28', 'movie_duration': 'PT1H36M', 'movie_description': 'Up is a movie starring Edward Asner, Jordan Nagai, and John Ratzenberger. 78-year-old Carl Fredricksen travels to Paradise Falls in his house equipped with balloons, inadvertently taking a young stowaway.'}, {'movie_name': 'Indiana Jones and the Last Crusade', 'movie_rating': '8.2', 'release_date': '1989-05-24', 'movie_duration': 'PT2H7M', 'movie_description': 'Indiana Jones and the Last Crusade is a movie starring Harrison Ford, Sean Connery, and Alison Doody. In 1938, after his father Professor Henry Jones, Sr. goes missing while pursuing the Holy Grail, Professor Henry "Indiana" Jones,...'}, {'movie_name': 'Heat', 'movie_rating': '8.2', 'release_date': '1995-12-15', 'movie_duration': 'PT2H50M', 'movie_description': 'Heat is a movie starring Al Pacino, Robert De Niro, and Val Kilmer. A group of professional bank robbers start to feel the heat from police when they unknowingly leave a clue at their latest heist.'}, {'movie_name': 'L.A. Confidential', 'movie_rating': '8.2', 'release_date': '1997-09-19', 'movie_duration': 'PT2H18M', 'movie_description': 'L.A. Confidential is a movie starring Kevin Spacey, Russell Crowe, and Guy Pearce. As corruption grows in 1950s Los Angeles, three policemen - one strait-laced, one brutal, and one sleazy - investigate a series of murders with their...'}, {'movie_name': 'Green Book', 'movie_rating': '8.2', 'release_date': '2018-11-16', 'movie_duration': 'PT2H10M', 'movie_description': 'Green Book is a movie starring Viggo Mortensen, Mahershala Ali, and Linda Cardellini. A working-class Italian-American bouncer becomes the driver of an African-American classical pianist on a tour of venues through the 1960s...'}, {'movie_name': 'Die Hard', 'movie_rating': '8.2', 'release_date': '1988-07-20', 'movie_duration': 'PT2H12M', 'movie_description': 'Die Hard is a movie starring Bruce Willis, Alan Rickman, and Bonnie Bedelia. An NYPD officer tries to save his wife and several others taken hostage by German terrorists during a Christmas party at the Nakatomi Plaza in Los Angeles.'}, {'movie_name': 'Batman Begins', 'movie_rating': '8.2', 'release_date': '2005-06-15', 'movie_duration': 'PT2H20M', 'movie_description': 'Batman Begins is a movie starring Christian Bale, Michael Caine, and Ken Watanabe. After training with his mentor, Batman begins his fight to free crime-ridden Gotham City from corruption.'}, {'movie_name': 'Yojinbo', 'movie_rating': '8.2', 'release_date': '1961-04-25', 'movie_duration': 'PT1H50M', 'movie_description': 'Yojinbo is a movie starring Toshirô Mifune, Eijirô Tôno, and Tatsuya Nakadai. A crafty ronin comes to a town divided by two criminal gangs and decides to play them against each other to free the town.'}, {'movie_name': 'Rashomon', 'movie_rating': '8.2', 'release_date': '1950-08-26', 'movie_duration': 'PT1H28M', 'movie_description': "Rashomon is a movie starring Toshirô Mifune, Machiko Kyô, and Masayuki Mori. The rape of a bride and the murder of her samurai husband are recalled from the perspectives of a bandit, the bride, the samurai's ghost and a woodcutter."},